20230202173634-machine_learning.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-09-04 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Machine Learning</title>
<meta name="author" content="root" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css' /><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">Machine Learning</h1>
<div id="outline-container-org84f0c10" class="outline-2">
<h2 id="org84f0c10"><a href="#org84f0c10">概要</a></h2>
<div class="outline-text-2" id="text-org84f0c10">
<p>
機械学習は、データから学習によって自動で改善するコンピュータアルゴリズムのこと。
</p>
</div>
</div>
<div id="outline-container-org90e11d8" class="outline-2">
<h2 id="org90e11d8"><a href="#org90e11d8">Memo</a></h2>
</div>
<div id="outline-container-org6ecd471" class="outline-2">
<h2 id="org6ecd471"><a href="#org6ecd471">Tasks</a></h2>
<div class="outline-text-2" id="text-org6ecd471">
</div>
<div id="outline-container-orge6c5bc1" class="outline-3">
<h3 id="orge6c5bc1"><a href="#orge6c5bc1"><span class="todo TODO">TODO</span> <a href="https://yutaroogawa.github.io/pytorch_tutorials_jp/">PyTorchチュートリアル（日本語翻訳版）</a></a></h3>
<div class="outline-text-3" id="text-orge6c5bc1">
<p>
Google Colaboratoryを使ったチュートリアル。
</p>
</div>
</div>
</div>
<div id="outline-container-orga25c97e" class="outline-2">
<h2 id="orga25c97e"><a href="#orga25c97e">Reference</a></h2>
<div class="outline-text-2" id="text-orga25c97e">
</div>
<div id="outline-container-orgd5cb704" class="outline-3">
<h3 id="orgd5cb704"><a href="#orgd5cb704"><a href="https://aizine.ai/tensor-0917/">機械学習で使う数学を学ぶなら覚えておこう！「テンソル」とは | AIZINE（エーアイジン）</a></a></h3>
<div class="outline-text-3" id="text-orgd5cb704">
<p>
テンソルの解説。
</p>
</div>
</div>
<div id="outline-container-orgc28c16d" class="outline-3">
<h3 id="orgc28c16d"><a href="#orgc28c16d"><a href="https://ja.wikipedia.org/wiki/TensorFlow">TensorFlow - Wikipedia</a></a></h3>
<div class="outline-text-3" id="text-orgc28c16d">
<p>
テンソルを扱うためのライブラリ。機械学習に用いる。テンソルは多次元データの集合体のこと。
</p>
</div>
</div>
<div id="outline-container-orgf620e5d" class="outline-3">
<h3 id="orgf620e5d"><a href="#orgf620e5d"><a href="https://ja.wikipedia.org/wiki/BERT_(%E8%A8%80%E8%AA%9E%E3%83%A2%E3%83%87%E3%83%AB)">BERT (言語モデル) - Wikipedia</a></a></h3>
<div class="outline-text-3" id="text-orgf620e5d">
<p>
自然言語処理の事前学習用のTransformerベースの機械学習手法。
</p>
</div>
</div>
<div id="outline-container-orgb952c59" class="outline-3">
<h3 id="orgb952c59"><a href="#orgb952c59"><a href="https://ja.wikipedia.org/wiki/Transformer_(%E6%A9%9F%E6%A2%B0%E5%AD%A6%E7%BF%92%E3%83%A2%E3%83%87%E3%83%AB)">Transformer (機械学習モデル) - Wikipedia</a></a></h3>
<div class="outline-text-3" id="text-orgb952c59">
<p>
主に自然言語処理の分野で使用される深層学習モデル。
</p>
</div>
</div>
<div id="outline-container-org666d030" class="outline-3">
<h3 id="org666d030"><a href="#org666d030"><a href="https://ja.wikipedia.org/wiki/CUDA">CUDA - Wikipedia</a></a></h3>
<div class="outline-text-3" id="text-org666d030">
<p>
NVIDIAが開発しているプラットフォームおよびプログラミングモデル。
</p>
</div>
</div>
</div>
<div id="outline-container-org083448d" class="outline-2">
<h2 id="org083448d"><a href="#org083448d">Archives</a></h2>
<div class="outline-text-2" id="text-org083448d">
</div>
<div id="outline-container-org5e964ba" class="outline-3">
<h3 id="org5e964ba"><a href="#org5e964ba"><span class="done DONE">DONE</span> <a href="https://www.youtube.com/watch?v=xzzTYL90M8s">高校数学からはじめる深層学習入門(畳み込みニューラルネットワークの理解) - YouTube</a></a></h3>
<div class="outline-text-3" id="text-org5e964ba">
<p>
深層学習の解説。
</p>

<dl class="org-dl">
<dt>学習</dt><dd>重みを最適化していくこと(=誤差関数を最小化)</dd>
<dt>(no term)</dt><dd>隠れ層が2つ以上あるものが深層学習という</dd>
<dt>(no term)</dt><dd>1次関数は合成しても1次関数</dd>
<dt>(no term)</dt><dd>活性化関数。値がある一定以下だと無視して、一定以上だと次に伝えてほしいような性質が必要</dd>
<dt>(no term)</dt><dd>プーリング層。位置がある程度変化しても、値が変わりにくいメリットがある(頑健性を獲得)</dd>
<dt>(no term)</dt><dd>ソフトマックス関数。分母は大きい値のときにその値が大きくなるように強調する。分子は合計を1にする(規格化)
<ul class="org-ul">
<li>0~1の値をとり、総和が1。確率に対応している。出力層でほしいのは確率の形式なので</li>
</ul></dd>
<dt>(no term)</dt><dd>誤差関数。交差エントロピーで計算する。間違っているときは大きく、正しいときは小さくなる
<ul class="org-ul">
<li>教師データが(1, 0, 0)で、予測が(0.8, 0.1, 0.1)のとき、0.09。小さい値</li>
<li>教師データが(1, 0, 0)で、予測が(0.2, 0.7, 0.1)のとき、1.61。大きい値</li>
</ul></dd>
</dl>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
